src/test/java/integration/features/adalconService/request/adalcon.txt

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:web="http://webservice.sat.mediosdepago.tecnocom.com" xmlns:xsd="http://satNewAge.soapwebservices.ease/xsd" xmlns:xsd1="http://webservice.sat.mediosdepago.tecnocom.com/xsd">
    <soap:Header/>
    <soap:Body>
        <web:runService>
            <web:msgEnvio>
                <xsd:entidad>0015</xsd:entidad>
                <xsd:password>#(password)</xsd:password>
                <xsd:tipoOperacion>INSERT</xsd:tipoOperacion>
                <xsd:usuario>#(usuario)</xsd:usuario>
                <xsd1:calparttar>TI</xsd1:calparttar>
                <xsd1:centalta>0007</xsd1:centalta>
                <xsd1:centroesttar>0001</xsd1:centroesttar>
                <xsd1:clamon1>152</xsd1:clamon1>
                <xsd1:clamon1tar>152</xsd1:clamon1tar>
                <xsd1:codregimen>1</xsd1:codregimen>
                <xsd1:coduso>C1</xsd1:coduso>
                <xsd1:condesttar>012</xsd1:condesttar>
                <xsd1:conprod>001</xsd1:conprod>
                <xsd1:forpago>1</xsd1:forpago>
                <xsd1:grupocuo>99</xsd1:grupocuo>
                <xsd1:grupoliq>05</xsd1:grupoliq>
                <xsd1:iban1>1</xsd1:iban1>
                <xsd1:indctaemp>0</xsd1:indctaemp>
                <xsd1:inddomcarcre>N</xsd1:inddomcarcre>
                <xsd1:inddomcarcre2>N</xsd1:inddomcarcre2>
                <xsd1:indenvesttar>S</xsd1:indenvesttar>
                <xsd1:indesttarext>S</xsd1:indesttarext>
                <xsd1:indesttarol>S</xsd1:indesttarol>
                <xsd1:indexecuo>0</xsd1:indexecuo>
                <xsd1:indlimuni>S</xsd1:indlimuni>
                <xsd1:indsitcta>0</xsd1:indsitcta>
                <xsd1:indtaremv>0</xsd1:indtaremv>
                <xsd1:indtipttar>1</xsd1:indtipttar>
                <xsd1:codmartar>1</xsd1:codmartar>
                <xsd1:producto>15</xsd1:producto>
                <xsd1:subprodu>0021</xsd1:subprodu>
                <xsd1:limcrecta1imp>7500000</xsd1:limcrecta1imp>
                <xsd1:nombenredtar>#(nombenredtar)</xsd1:nombenredtar>
                <xsd1:numper>#(numper)</xsd1:numper>
                <xsd1:numpertar>#(numper)</xsd1:numpertar>
                <xsd1:numsec>1</xsd1:numsec>
                <xsd1:ofiven>1</xsd1:ofiven>
            </web:msgEnvio>
        </web:runService>
    </soap:Body>
</soap:Envelope>